swak4foam/Examples/groovyBC/delayed-t-junction/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//           inlet1
//             +-+
//             | |
//             | |
//             | |
//             | |
// +-----------+ |
// |outlet       |
// +-----------+ |
//             | |
//             | |
//             | |
//             | |
//             +-+
//           inlet2

convertToMeters 1;

vertices
(
    (0.0  -0.01 0)   //0
    (0.2  -0.01 0)
    (0.2   0.01 0)   //2
    (0.0   0.01 0)

    (0.24 -0.01 0)  //4
    (0.24  0.01 0)

    (0.2  -0.21 0)  //6
    (0.24 -0.21 0)

    (0.2   0.21 0)  //8
    (0.24  0.21 0)

    // Z
    (0.0  -0.01 0.02)   //0
    (0.2  -0.01 0.02)
    (0.2   0.01 0.02)   //2
    (0.0   0.01 0.02)

    (0.24 -0.01 0.02)  //4
    (0.24  0.01 0.02)

    (0.2  -0.21 0.02)  //6
    (0.24 -0.21 0.02)

    (0.2   0.21 0.02)  //8
    (0.24  0.21 0.02)

    (0.18   -0.01    0)
    (0.18    0.01    0)
    (0.18   -0.01    0.02)
    (0.18    0.01    0.02)

    (0.18  -0.21 0)
    (0.18  -0.21 0.02)
);

blocks
(
    // inlet block
    hex (0 20 21 3  10 22 23 13) (50 5 5) simpleGrading (1 1 1)

    // central block
    hex (1 4 5 2  11 14 15 12) (10 5 5) simpleGrading (1 1 1)

    // bottom block
    hex (6 7 4 1  16 17 14 11) (10 50 5) simpleGrading (1 1 1)

    // top block
    hex (2 5 9 8  12 15 19 18) (10 50 5) simpleGrading (1 1 1)

    // inlet 2
    hex (20 1 2 21 22 11 12 23) (5 5 5) simpleGrading (1 1 1)

    // bottom block 2
    hex (24 6 1 20 25 16 11 22) (5 50 5) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    patch outlet
    (
        (0 10 13 3)
    )

    patch inlet2
    (
        (6 7 17 16)
        (24 6 16 25)
    )

    patch inlet1
    (
        (8 18 19 9)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
